
Internet Engineering Task Force                          P. Bhattacharya
INTERNET DRAFT                                                  B. Patel
                                                              C. Perkins
                                                            IBM Research
                                                        22 February 1996


            Preference for Multicast Support with Mobile IP
                 draft-partha-mobileip-mcastpref-00.txt


Status of This Memo

   This document is a submission to the Mobile-IP Working Group of the
   Internet Engineering Task Force (IETF). Comments should be submitted
   to the mobile-ip@smallworks.com mailing list.

   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at
   any time.  It is inappropriate to use Internet- Drafts as reference
   material or to cite them other than as ``work in progress.''

   To learn the current status of any Internet-Draft, please check the
   ``1id-abstracts.txt'' listing contained in the Internet- Drafts
   Shadow Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe),
   munnari.oz.au (Pacific Rim), ds.internic.net (US East Coast), or
   ftp.isi.edu (US West Coast).


Abstract

   This document specifies a new extension to the Registration Request
   used by mobile nodes with the mobile-IP protocol.  The new extension
   allows the mobile node to select the particular IP multicasts which
   the home agent or foreign agent should forward to the mobile node
   when it attaches to the Internet at a care-of address not on its home
   network.










Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page i]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


1. Introduction

   Mobile-IP [1] allows mobile nodes to move from one point of
   attachment within the Internet to another, and defines mechanisms
   by which a home agent on the mobile node's home network can send
   datagrams to the mobile node.  Since the mobile node's IP address
   makes it seem to other routers as if the mobile node is on the
   same network as the home agent (i.e., as if the mobile node is on
   its "home network"), datagrams from other networks destined to the
   mobile node will be transmitted onto the mobile node's home network,
   where they can be received by the home agent and encapsulated for
   delivery to the mobile node's care-of address.  The mobile node's
   care-of address can be an address assigned to one of the mobile
   node's network interfaces, or it can be an address advertised by a
   mobility agent near the current whereabouts of the mobile node.  Such
   a mobility agent is called a foreign agent.

   A mobile node on a foreign network may need to send and receive
   multicast packets either directly from the foreign network or from
   its home network via its home agent.  Depending on the application,
   a mobile node may wish to have any of the above options on a per
   multicast address basis.  While the Mobile-IP specification specifies
   relevant details about the transmission and reception of multicast
   datagrams from its home network, it does not specify how a mobile
   node can choose these options in a foreign network.

   This document specifies an extension to the mobile-IP Registration
   Request message to allow the mobile node to specify its options in
   sending and receiving multicast datagrams on a per multicast address
   basis.  The mobile node appends the new extension to the Registration
   Request it sends at its current point of attachment.


2. Multicast Preference Extension

   The Multicast Preference extension allows a mobile node to specify,
   at the time it registers its current care-of address, send and
   receive options for various multicast addresses.  The Multicast
   Preference extension may be included several times within a single
   registration request, once for every multicast address.

DISCUSSION:
       What other constraints should be considered?








Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 1]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0  1  2  3  4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+--+--+--+--+-+-+-+-+-+-+-+-+-+
   |     Type      |     Length    |C|P|A|XH|XF|RH|RF|      rsvd       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+--+--+--+--+-+-+-+-+-+-+-+-+-+
   |                      Multicast IP address                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Type       41

      Length     4 + (4 * number of Multicast IP addresses listed)

      C          If the 'C' ('Clean') flag is set, the mobility agent is
                 instructed to eliminate any retained specifications for
                 multicast datagrams which the mobile node had included
                 in any previous Multicast Preference extensions.

      P          If the 'P' ('Permanent') flag is set, the mobility
                 agent is instructed to keep the following multicast
                 datagrams specification active until the mobile node
                 registers again using the 'C' flag.

      A          If the 'A' ('Additional') flag is set, the mobility
                 agent is instructed to include this preference for
                 receiving multicasts along with other preferences
                 previously specified by the mobile node.

                 If 'A' flag is not set (0), the mobility agent is
                 instructed to delete all non-permanent preferences
                 previously specified by the mobile node before storing
                 this preference.

                 If 'P' flag is set, 'A' flag is ignored.

      XH         If the 'XH' ('Transmit at Home') flag is set, then the
                 mobile node wishes to transmit packets destined to the
                 address specified in the Multicast IP address field, in
                 the mobile node's home network.

      XF         If the 'XH' ('Transmit in Foreign') flag is set, then
                 the mobile node wishes to transmit packets destined
                 to the address specified in the Multicast IP address
                 field, in the mobile node's foreign network.

      RH         If the 'RH' ('Receive from Home') flag is set, then the
                 mobile node wishes to receive packets destined to the
                 address specified in the Multicast IP address field,
                 from the mobile node's home network.



Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 2]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


      RF         If the 'RL' ('Receive from Foreign') flag is set, then
                 the mobile node wishes to receive packets destined
                 to the address specified in the Multicast IP address
                 field, in the mobile node's foreign network.

      rsvd       0

      Multicast IP addresses Flags and options specified by this
                 Multicast Preference extension apply to the Multicast
                 IP addresses listed in this field.

   All extensions to the mobile-IP registration request have a type
   field and a length field, as shown above.  The number of Multicast
   IP addresses listed will determine the length of the Multicast
   Preference Extension.

   If the mobile node wishes to clear ALL of its Multicast Preferences,
   it sends a Multicast Preference Extension with the 'C' bit set, and
   zero Multicast IP addresses listed.


3. Home Agent Considerations

   If the home agent cannot satisfy the request, it MUST reject the
   Registration Request by issuing a Registration Reply using the newly
   defined status code:

        145          Multicast Preference Not Supported

   When a mobile node is attached to its home network, a home agent
   MUST not forward multicasts to the mobile node.  When a mobile node
   is away from home, the following actions MUST be taken by the home
   agent.

    -  If the 'XH' flag is set, then the home agent should transmit the
       packets received from the mobile node, on the local network.

    -  If the 'XF' flag is set, no special actions are required from the
       home agent.

    -  If the 'RH' flag is set, the home agent MUST respond to the IGMP
       membership queries [2, 3] by including the multicast address
       in its reports.  The home agent MAY optionally tunnel the IGMP
       membership queries to the mobile host.  Also, the home agent MUST
       tunnel the multicast packets to the mobile host for the specified
       multicast address.





Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 3]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


    -  If the 'RF' flag is set, no special actions are required from the
       home agent.

   When a mobile node includes the 'P' flag in the Multicast Preference
   extension to a registration request, the home agent MUST keep
   track of the requested Multicast Preference(s) for the mobile node
   until the mobile node clears the information with a new Multicast
   Preference extension containing the 'C' flag.  In this way, the
   mobile node may be relieved of the requirement to send in the same
   list of Multicast Preference extensions every time it registers at a
   new care-of address.


4. Foreign Agent Considerations

   If the 'XH' flag is set, then the Foreign agent MUST tunnel packets
   received from the mobile node to the home agent.

   If the 'XF' flag is set, and the foreign agent receives an
   IP-within-IP datagram from the mobile node, then the foreign agent
   MUST decapsulate the datagram, and replace the source address in the
   multicast datagram with the Care-of-Address and submit the datagram
   for IP processing.

   If both 'XH' and 'XF' flags are set, both actions above MUST be
   performed.

   If the 'RH' flag is set, then the foreign agent MUST process tunneled
   datagrams in one of the following ways:

    -  Transmit the multicast datagram from the interface sharing a link
       with the mobile node, with TTL set to 1.

    -  Encapsulate the multicast datagram within a unicast IP datagram
       addressed to the mobile node's home address, and submit for IP
       processing.

   If the 'RF' flag is set, and the foreign agent is acting as the
   default router for the mobile node, the foreign agent transmits
   multicast datagrams with the specified multicast address to the
   mobile node.


5. Mobile Node Considerations

   If the mobile host is attached to its home network, no special action
   is required by mobile host.




Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 4]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


   If the mobile host is attached to a foreign network, and the
   Registration Request with the appended Multicast Preference Extension
   was accepted by its home agent (and, if applicable, the foreign
   agent advertising the care-of address used in the Registration), the
   following actions are required.

   If 'XH' flag was set, the mobile host MUST encapsulate every
   multicast datagram within an unicast IP datagram addressed to the
   home agent.

   If 'XF' flag was set, it MUST do one of the following:

    -  Encapsulate every multicast datagram within an unicast IP
       datagram addressed to the foreign agent.

    -  Transmit every multicast datagram with source address set to the
       care-of address.

DISCUSSION:
        Is this a reasonable way to offload processing from the foreign
        agent?  Should the Preference Extension contain another
        flag to distinguish the two modes of operation?

   If 'RH' flag was set, the mobile host MUST decapsulate IP in IP
   packets [5].

   If 'RF' flag was set, the mobile host MUST respond to the IGMP
   membership queries.


6. Related Work

   This draft specification is related to a companion draft
   specification for the Broadcast Preference Extension for
   Mobile-IP [4].  Changes to one document should be considered for
   their impact on the issues in the other document.















Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 5]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996


References

   [1] IPv4 Mobility Support.  ietf-draft-mobileip-protocol-15.txt -
       work in progress, February 1996.

   [2] Steve Deering.  Host Extensions for IP Multicasting.  RFC 1112,
       August 1989.

   [3] W. Fenner.  Internet Group Management Protocol, Version 2.
       draft-ietf-idmr-igmp-v2-02.txt -- work in progress, February
       1996.

   [4] B. Patel and C. Perkins.  Preference for Broadcast Datagram
       Support with Mobile IP.  draft-perkins-mobileip-bcastpref-00.txt
       -- work in progress, February 1996.

   [5] Charles Perkins.  IP Encapsulation within IP.
       draft-ietf-ip4inip4-01.txt -- work in progress, October 1995.


Authors' Addresses

   Questions about this memo can also be directed to:


     Partha Bhattacharya                Baiju Patel
     Room H3-D40                        Room H3-D36
     T. J. Watson Research Center       T. J. Watson Research Center
     IBM Corporation                    IBM Corporation
     Hawthorne, NY  10532               Hawthorne, NY  10532
     30 Saw Mill River Rd.              30 Saw Mill River Rd.

     Work:   +1-914-784-7981            Work:   +1-914-784-6786
     Fax:    +1-914-784-6205            Fax:    +1-914-784-6205
     E-mail: partha@watson.ibm.com      E-mail: baiju@watson.ibm.com


     Charles Perkins
     Room H3-D34
     T. J. Watson Research Center
     IBM Corporation
     30 Saw Mill River Rd.
     Hawthorne, NY  10532

     Work:   +1-914-784-7350
     Fax:    +1-914-784-6205
     E-mail: perk@watson.ibm.com




Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 6]

Internet Draft      Mobile-IP Multicast Preference      22 February 1996





















































Bhattacharya, Patel, Perkins       Expires 22 August 1996       [Page 7]
